case_steady_coarsen/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.0001;
    }

    "(U|k|epsilon|omega)"
    {
        //solver           smoothSolver;
        //smoother         GaussSeidel;
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance        1e-8;
        relTol           0.0001;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent               true;
    pRefCell                 0;
    pRefValue                0;
}

relaxationFactors
{
    equations
    {
        p                       0.5;
        U                       0.7;
        "(k|epsilon|omega)"     0.8;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
